# Terraform environment prod
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
data.azuread_application.kv_sp: Reading...
data.azuread_application.kv_sp: Read complete after 0s [id=/applications/570ae202-0655-482f-8aee-f885aa852685]
data.azuread_service_principal.aks_sp: Reading...
data.azuread_service_principal.aks_sp: Read complete after 1s [id=/servicePrincipals/f45036c4-af13-422c-8887-225805e2c777]
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iMTkxZTU1Ni0wODc4LTQzYzAtOTNiNS0xMjhhNWJmMWQ2OTk7b2JqZWN0SWQ9NjlhM2I0ZjgtYTExOS00NzM0LTk2NTgtZmNiZjdjNjM4M2U2O3N1YnNjcmlwdGlvbklkPTBmMDVlOWQ0LTU5MmItNDkxYS1iOWRhLTQ5YThiMjQyZDBjNTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_application_insights.adminapp_ai will be updated in-place
  ~ resource "azurerm_application_insights" "adminapp_ai" {
        id                                    = "/subscriptions/0f05e9d4-592b-491a-b9da-49a8b242d0c5/resourceGroups/altinn-digdir-oed-rg/providers/Microsoft.Insights/components/dd-prod-adminapp-ai"
        name                                  = "dd-prod-adminapp-ai"
      ~ tags                                  = {
          + "costcenter" = "altinn3"
          + "solution"   = "apps"
        }
        # (16 unchanged attributes hidden)
    }

  # azurerm_cdn_frontdoor_endpoint.endpoint will be created
  + resource "azurerm_cdn_frontdoor_endpoint" "endpoint" {
      + cdn_frontdoor_profile_id = (known after apply)
      + enabled                  = true
      + host_name                = (known after apply)
      + id                       = (known after apply)
      + name                     = "digdir-dd-prod-authz"
    }

  # azurerm_cdn_frontdoor_firewall_policy.waf_policy will be created
  + resource "azurerm_cdn_frontdoor_firewall_policy" "waf_policy" {
      + enabled                                   = true
      + frontend_endpoint_ids                     = (known after apply)
      + id                                        = (known after apply)
      + js_challenge_cookie_expiration_in_minutes = (known after apply)
      + mode                                      = "Prevention"
      + name                                      = "oedwafpolicyprod"
      + request_body_check_enabled                = true
      + resource_group_name                       = "altinn-digdir-oed-rg"
      + sku_name                                  = "Premium_AzureFrontDoor"

      + custom_rule {
          + action                         = "Allow"
          + enabled                        = true
          + name                           = "AllowEUEOS1"
          + priority                       = 1
          + rate_limit_duration_in_minutes = 1
          + rate_limit_threshold           = 10
          + type                           = "MatchRule"

          + match_condition {
              + match_values       = [
                  + "IS",
                  + "LI",
                  + "NO",
                  + "CH",
                  + "SE",
                  + "DK",
                  + "FI",
                  + "EE",
                  + "LV",
                ]
              + match_variable     = "RemoteAddr"
              + negation_condition = false
              + operator           = "GeoMatch"
            }
        }
      + custom_rule {
          + action                         = "Allow"
          + enabled                        = true
          + name                           = "AllowEUEOS2"
          + priority                       = 2
          + rate_limit_duration_in_minutes = 1
          + rate_limit_threshold           = 10
          + type                           = "MatchRule"

          + match_condition {
              + match_values       = [
                  + "HU",
                  + "IE",
                  + "IT",
                  + "LU",
                  + "MT",
                  + "NL",
                  + "PL",
                  + "PT",
                  + "RO",
                  + "SK",
                ]
              + match_variable     = "RemoteAddr"
              + negation_condition = false
              + operator           = "GeoMatch"
            }
        }
      + custom_rule {
          + action                         = "Allow"
          + enabled                        = true
          + name                           = "AllowEUEOS3"
          + priority                       = 3
          + rate_limit_duration_in_minutes = 1
          + rate_limit_threshold           = 10
          + type                           = "MatchRule"

          + match_condition {
              + match_values       = [
                  + "SI",
                  + "ES",
                ]
              + match_variable     = "RemoteAddr"
              + negation_condition = false
              + operator           = "GeoMatch"
            }
        }
      + custom_rule {
          + action                         = "Block"
          + enabled                        = true
          + name                           = "DenyAllOthers"
          + priority                       = 100
          + rate_limit_duration_in_minutes = 1
          + rate_limit_threshold           = 10
          + type                           = "MatchRule"

          + match_condition {
              + match_values       = [
                  + "0.0.0.0/0",
                ]
              + match_variable     = "RemoteAddr"
              + negation_condition = false
              + operator           = "IPMatch"
            }
        }

      + managed_rule {
          + action  = "Block"
          + type    = "Microsoft_DefaultRuleSet"
          + version = "2.1"
        }
      + managed_rule {
          + action  = "Block"
          + type    = "Microsoft_BotManagerRuleSet"
          + version = "1.1"
        }
    }

  # azurerm_cdn_frontdoor_origin.app_origin will be created
  + resource "azurerm_cdn_frontdoor_origin" "app_origin" {
      + cdn_frontdoor_origin_group_id  = (known after apply)
      + certificate_name_check_enabled = true
      + enabled                        = true
      + host_name                      = "oed-authz-app.azurewebsites.net"
      + http_port                      = 80
      + https_port                     = 443
      + id                             = (known after apply)
      + name                           = "oed-appservice-origin-prod"
      + origin_host_header             = "oed-authz-app.azurewebsites.net"
      + priority                       = 1
      + weight                         = 500
    }

  # azurerm_cdn_frontdoor_origin_group.origin_group will be created
  + resource "azurerm_cdn_frontdoor_origin_group" "origin_group" {
      + cdn_frontdoor_profile_id                                  = (known after apply)
      + id                                                        = (known after apply)
      + name                                                      = "oed-origin-group-prod"
      + restore_traffic_time_to_healed_or_new_endpoint_in_minutes = 10
      + session_affinity_enabled                                  = true

      + load_balancing {
          + additional_latency_in_milliseconds = 50
          + sample_size                        = 4
          + successful_samples_required        = 3
        }
    }

  # azurerm_cdn_frontdoor_profile.fd_profile will be created
  + resource "azurerm_cdn_frontdoor_profile" "fd_profile" {
      + id                       = (known after apply)
      + name                     = "oed-fd-profile-prod"
      + resource_group_name      = "altinn-digdir-oed-rg"
      + resource_guid            = (known after apply)
      + response_timeout_seconds = 120
      + sku_name                 = "Premium_AzureFrontDoor"
    }

  # azurerm_cdn_frontdoor_route.route will be created
  + resource "azurerm_cdn_frontdoor_route" "route" {
      + cdn_frontdoor_endpoint_id     = (known after apply)
      + cdn_frontdoor_origin_group_id = (known after apply)
      + cdn_frontdoor_origin_ids      = (known after apply)
      + enabled                       = true
      + forwarding_protocol           = "HttpsOnly"
      + https_redirect_enabled        = true
      + id                            = (known after apply)
      + link_to_default_domain        = true
      + name                          = "default-route-prod"
      + patterns_to_match             = [
          + "/*",
        ]
      + supported_protocols           = [
          + "Http",
          + "Https",
        ]
    }

  # azurerm_cdn_frontdoor_security_policy.waf_security_policy will be created
  + resource "azurerm_cdn_frontdoor_security_policy" "waf_security_policy" {
      + cdn_frontdoor_profile_id = (known after apply)
      + id                       = (known after apply)
      + name                     = "oed-fd-security-policy-prod"

      + security_policies {
          + firewall {
              + cdn_frontdoor_firewall_policy_id = (known after apply)

              + association {
                  + patterns_to_match = [
                      + "/*",
                    ]

                  + domain {
                      + active                  = (known after apply)
                      + cdn_frontdoor_domain_id = (known after apply)
                    }
                }
            }
        }
    }

  # azurerm_key_vault_secret.admin_app_client_secret will be updated in-place
  ~ resource "azurerm_key_vault_secret" "admin_app_client_secret" {
      ~ expiration_date         = "2027-06-18T11:38:08Z" -> "2027-06-18T11:38:07.6497736Z"
        id                      = "https://oed-prod-kv.vault.azure.net/secrets/dd-admin-app-client-secret/65c1d0bee54749278b77163cbce570a3"
        name                    = "dd-admin-app-client-secret"
      ~ not_before_date         = "2025-06-18T11:38:08Z" -> "2025-06-18T11:38:07.6497736Z"
        tags                    = {}
        # (8 unchanged attributes hidden)
    }

  # azurerm_windows_function_app.feedpoller will be updated in-place
  ~ resource "azurerm_windows_function_app" "feedpoller" {
        id                                             = "/subscriptions/0f05e9d4-592b-491a-b9da-49a8b242d0c5/resourceGroups/altinn-digdir-oed-rg/providers/Microsoft.Web/sites/oed-feedpoller-func"
        name                                           = "oed-feedpoller-func"
      ~ tags                                           = {
            "costcenter"                                     = "altinn3"
            "hidden-link: /app-insights-conn-string"         = (sensitive value)
            "hidden-link: /app-insights-instrumentation-key" = (sensitive value)
          - "hidden-link: /app-insights-resource-id"         = "/subscriptions/0f05e9d4-592b-491a-b9da-49a8b242d0c5/resourceGroups/altinn-digdir-oed-rg/providers/microsoft.insights/components/oed-feedpoller-ai" -> null
            "solution"                                       = "apps"
        }
        # (34 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # azurerm_windows_web_app.authz will be updated in-place
  ~ resource "azurerm_windows_web_app" "authz" {
        id                                             = "/subscriptions/0f05e9d4-592b-491a-b9da-49a8b242d0c5/resourceGroups/altinn-digdir-oed-rg/providers/Microsoft.Web/sites/oed-authz-app"
        name                                           = "oed-authz-app"
      ~ tags                                           = {
            "hidden-link: /app-insights-conn-string"         = (sensitive value)
            "hidden-link: /app-insights-instrumentation-key" = (sensitive value)
          ~ "hidden-link: /app-insights-resource-id"         = "/subscriptions/0f05e9d4-592b-491a-b9da-49a8b242d0c5/resourceGroups/altinn-digdir-oed-rg/providers/microsoft.insights/components/oed-authz-ai" -> "/subscriptions/0f05e9d4-592b-491a-b9da-49a8b242d0c5/resourceGroups/altinn-digdir-oed-rg/providers/Microsoft.Insights/components/oed-authz-ai"
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 7 to add, 4 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @kurt70 |
| Action | `push` |
| Working Directory | `./infra/altinn-digdir-oed-rg` |
| State File | `github.com/altinn/dd-infrastructure/environments/prod/altinn-digdir-oed-rg.tfstate` |
| Plan File | `github.com_altinn_dd-infrastructure_environments_prod_altinn-digdir-oed-rg.tfstate.tfplan`